app/Models/Md_adminpanel.php

  public function fn_login($email)
  {
      // Ambil dari tbl_employee berdasarkan email
      $employee = $this->db->table('tbl_employee')
          ->select('id as idemployee')
          ->where('email', $email)
          ->get()
          ->getRowArray();

      if ($employee) {
          // Cek apakah idemployee ada di tbl_password
          $check = $this->db->table('tbl_password')
              ->where('idemployee', $employee['idemployee'])
              ->get()
              ->getRowArray();
---
SELECT `id` as `idemployee`
FROM `tbl_employee`
WHERE `email` = 'milania.nunes@gmail.com'
SELECT *
FROM `tbl_password`
WHERE `idemployee` = '1'